static_mixer/case_base/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        //type            fixedValue;
        //value           uniform (0 0 2);

        type            surfaceNormalFixedValue;
        refValue        uniform -1;
    }

    inlet2
    {
        //type            fixedValue;
        //value           uniform (0 0 -2);

        type            surfaceNormalFixedValue;
        refValue        uniform -0.5;
    }

    outlet
    {
        type            zeroGradient;
	//type		pressureNormalInletOutletVelocity;
	//value		uniform (0 0 0);
    }

    "walls.*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
