static_mixer/case_base/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    "walls.*"
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
