static_mixer/case_base/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
/*
        type            fixedValue;
        value           uniform 0;
*/

        type            zeroGradient;
    }

    inlet2
    {
/*
        type            fixedValue;
        value           uniform 0;
*/

        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;

        //type            totalPressure;
        //p0              uniform 0;

      //type            zeroGradient;
    }

    "walls.*"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
