static_mixer/case_base/0_org/s1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      s1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   inlet1
    {
        type            fixedValue;
	value		    uniform 1;
        //type            zeroGradient;
    }

    inlet2
    {
	//if you use this BC this quantity will become unbounded at the patch
        //type            zeroGradient;			

        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
 

    outlet
    {
        type            zeroGradient;
    }

    "walls.*"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
