static_mixer/case_base/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

//nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;

//nu water
//  nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;

//nu water
  nu              nu [ 0 2 -1 0 0 0 0 ] 1.8e-5;

//For my_icoFoam.  Transport equation coefficient.
//DT            DT [0 2 -1 0 0 0 0] 0.01;
DT            [0 2 -1 0 0 0 0] 0;
// ************************************************************************* //
