static_mixer/case_base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.001;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    "(k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    "(s1|s2)"
    {

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes;

/*
    residualControl
    {
        p               1e-3;
        U               1e-3;
        k               1e-3;
        omega           1e-3;
        s1              1e-3;
        s2              1e-3;
    }
*/
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
	p		0.7;
    }
    equations
    {
	p		0.7;
        U               0.7;
        k               0.7;
        omega           0.7;
        s1              0.7;
        s2              0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
